<template>
    <BaseLayout>
      <div class="w-full p-4">
        <!-- Центрированный контейнер с ограниченной шириной для удобочитаемости -->
        <div class="max-w-3xl mx-auto">
          <h1 class="text-3xl font-bold mb-4">Уведомление о конфиденциальности</h1>
          <p class="mb-2">Версия: 1.0</p>
          <p class="mb-4">Последнее обновление: 10 февраля 2025</p>
  
          <h2 class="text-2xl font-semibold mt-4 mb-2">Введение</h2>
          <p class="mb-4">
            Настоящее уведомление о конфиденциальности описывает, как мы обрабатываем ваши персональные данные при использовании нашего сайта (https://crashslots.ru/), включая версии для настольных компьютеров и мобильных устройств, а также любые сопутствующие приложения и наши официальные страницы в социальных сетях (совместно именуемые «Сайт»).
          </p>
          <p class="mb-4">
            Мы привержены защите ваших персональных данных при использовании наших услуг через Сайт. Безопасность ваших данных для нас имеет первостепенное значение, и мы внедрили строгие меры для их защиты.
          </p>
          <p class="mb-4">
            В данном уведомлении описаны наши процедуры по сбору и использованию ваших персональных данных.
          </p>
  
          <h2 class="text-2xl font-semibold mt-4 mb-2">Кто мы</h2>
          <p class="mb-4">
            Под терминами «мы», «нас» или «наш» в данном уведомлении понимаются:
          </p>
          <p class="mb-4">
            <strong>Inextro B.V.</strong>, компания, зарегистрированная на Кюрасао под регистрационным номером 146616, с юридическим адресом: Fransche Bloemweg 4, Willemstad, Curaçao, а также <strong>Beriston Limited</strong> — её дочернее предприятие, полностью ей принадлежащее, зарегистрированное на Кипре под регистрационным номером HE385830, с юридическим адресом: Prodromou ave 75, ONEWORLD PARKVIEW HOUSE, 3-й этаж, квартира/офис 304, 2063, Никосия, Кипр.
          </p>
          <p class="mb-4">
            Мы контролируем способы сбора ваших персональных данных и цели их использования, выступая в качестве контролёра данных.
          </p>
          <p class="mb-4">Наши контактные данные:</p>
          <p class="mb-4">
            <strong>Inextro B.V.</strong><br>
            Fransche Bloemweg 4, Willemstad, Curaçao
          </p>
          <p class="mb-4">
            <strong>Представительство в Европейском Союзе:</strong><br>
            Beriston Limited<br>
            Prodromou ave 75, ONEWORLD PARKVIEW HOUSE, 3-й этаж, квартира/офис 304, 2063, Никосия, Кипр
          </p>
          <p class="mb-4">
            Электронная почта:
            <a href="mailto:casino.assist.team@gmail.com" class="text-blue-500 hover:underline">
              casino.assist.team@gmail.com
            </a>
          </p>
  
          <h2 class="text-2xl font-semibold mt-4 mb-2">Ответственный за защиту данных (DPO)</h2>
          <p class="mb-4">
            Если вам требуется дополнительная информация по данному уведомлению о конфиденциальности или по вопросам обработки ваших персональных данных при использовании нашего Сайта, пожалуйста, свяжитесь с нашим ответственным за защиту данных (DPO):
          </p>
          <p class="mb-4">
            По почте: Beriston Limited, Prodromou ave 75, ONEWORLD PARKVIEW HOUSE, 3-й этаж, квартира/офис 304, 2063, Никосия, Кипр
          </p>
          <p class="mb-4">
            По электронной почте:
            <a href="mailto:casino.assist.team@gmail.com" class="text-blue-500 hover:underline">
              casino.assist.team@gmail.com
            </a>
          </p>
  
          <h2 class="text-2xl font-semibold mt-4 mb-2">Как мы собираем ваши персональные данные</h2>
          <p class="mb-4">
            Ниже приведены типы данных, которые мы собираем, и методы их сбора. Важно отметить, что предоставление персональных данных не является обязательным. Однако некоторые данные необходимы для предоставления услуг и обеспечения их качества (например, для создания вашей учетной записи на Сайте). Отказ от предоставления необходимых персональных данных может привести к невозможности доступа к услугам.
          </p>
          <p class="mb-4">
            Кроме того, мы обязаны собирать определённые персональные данные для выполнения юридических и регуляторных требований, включая меры по противодействию отмыванию денег, рекомендации по ответственному азартному поведению и соблюдение лицензионных условий оператора азартных игр. Если вы откажетесь предоставить данные, требуемые по закону, мы не сможем предоставить вам доступ к нашему Сайту.
          </p>
  
          <h3 class="text-xl font-semibold mt-4 mb-2">1. Персональные данные, предоставляемые вами напрямую</h3>
          <ul class="list-disc list-inside mb-4">
            <li class="mb-2">
              <strong>Данные учетной записи:</strong> ваше имя, имя пользователя, дата рождения, пароль, адрес электронной почты, почтовый адрес и номер мобильного телефона, указанные при создании учетной записи.
            </li>
            <li class="mb-2">
              <strong>Данные для верификации:</strong> в некоторых случаях мы можем потребовать копии документов, удостоверяющих личность, банковские выписки, налоговые счета или счета за коммунальные услуги. Эти документы необходимы для проверки личности и соблюдения норм противодействия отмыванию денег (AML).
            </li>
            <li class="mb-2">
              <strong>Данные переписки:</strong> любая коммуникация с нами по электронной почте, через почту, чат или телефон может сохраняться, включая содержащуюся в ней информацию.
            </li>
            <li class="mb-2">
              Мы записываем телефонные звонки и сохраняем ваши сообщения со службой поддержки. Эти меры помогают улучшить качество обслуживания (например, для обучения персонала), обеспечить безопасность (например, для проверки личности), защитить наши деловые интересы (например, при защите в судебных спорах) и соответствовать регуляторным требованиям (например, мониторинг звонков, связанных с ответственным азартом).
            </li>
          </ul>
  
          <h3 class="text-xl font-semibold mt-4 mb-2">2. Персональные данные, собираемые при использовании Сайта</h3>
          <ul class="list-disc list-inside mb-4">
            <li class="mb-2">
              <strong>Платежные данные:</strong> мы обеспечиваем конфиденциальность ваших данных при передаче посредством SSL-шифрования. Все платежные операции обрабатываются через сервер платежного шлюза. При этом мы сохраняем историю ваших депозитов и снятий, а также ограниченные данные о платеже, такие как последние четыре цифры кредитной карты, банк-эмитент и другую релевантную информацию.
            </li>
            <li class="mb-2">
              <strong>Игровые данные:</strong> при использовании наших услуг мы фиксируем информацию о действиях, связанных с вашей учетной записью (балансы, ставки, бонусы, выигрыши).
            </li>
            <li class="mb-2">
              <strong>Данные устройства:</strong> мы собираем информацию об используемом вами устройстве, включая IP-адрес, общее местоположение или регион доступа в Интернет, браузер, операционную систему и прочие данные об использовании Сайта.
            </li>
            <li class="mb-2">
              <strong>Данные активности:</strong> взаимодействие с Сайтом, включая ответы на сообщения и участие в различных активностях, позволяет нам собирать дополнительную информацию (например, показатели открытия/клика по письмам, взаимодействия со ссылками, время просмотра страниц и т.д.).
            </li>
            <li class="mb-2">
              <strong>Маркетинговые данные:</strong> мы можем собирать данные о вашем взаимодействии с нашими маркетинговыми инициативами, включая клики по рекламе, а также информацию о маркетинговых партнёрах, кампаниях, каналах, источниках трафика и рекламе, с которой вы взаимодействуете.
            </li>
            <li class="mb-2">
              <strong>Данные профиля:</strong> анализируя ваше взаимодействие с Сайтом, мы можем создавать внутренние записи для лучшего понимания ваших интересов, предпочтений и любимых игр.
            </li>
          </ul>
  
          <h3 class="text-xl font-semibold mt-4 mb-2">3. Персональные данные, получаемые от третьих лиц</h3>
          <ul class="list-disc list-inside mb-4">
            <li class="mb-2">
              <strong>Поставщики верификации:</strong> для выполнения наших юридических и регуляторных обязательств мы можем получать данные от сторонних сервисов для проверки ваших идентификационных данных и другой соответствующей информации.
            </li>
            <li class="mb-2">
              <strong>Платежные провайдеры:</strong> при проведении транзакций мы можем получать ограниченную информацию (например, последние четыре цифры вашей карты, валюту, сумму и т.д.) от третьих лиц.
            </li>
            <li class="mb-2">
              <strong>Маркетинговые провайдеры:</strong> для анализа поведения нашей аудитории мы можем собирать информацию о вас через сеть поставщиков рекламных услуг, продвигающих наш Сайт.
            </li>
            <li class="mb-2">
              <strong>Провайдеры аналитики:</strong> для улучшения понимания аудитории и оптимизации работы Сайта мы получаем данные от аналитических сервисов, предоставляющих инструменты для анализа.
            </li>
          </ul>
          <p class="mb-4">
            Сайт <a href="https://crashslots.ru/" class="text-blue-500 hover:underline">https://crashslots.ru/</a> использует SSL-шифрование для обеспечения конфиденциальности ваших данных при передаче. Ни в коем случае мы не собираем, не храним и не передаем данные вашей карты. Все платежные операции осуществляются через защищённый сервер платежного шлюза(ов) и/или процессора(ов). Beriston Ltd не будет продавать, покупать, предоставлять, обменивать или иным образом раскрывать данные вашей учетной записи или транзакций, а также персональную информацию держателя карты, за исключением случаев, предусмотренных эквайером, платежными системами или законными требованиями государственных органов.
          </p>
  
          <h3 class="text-xl font-semibold mt-4 mb-2">4. Особые категории персональных данных и информация о судимостях и правонарушениях</h3>
          <p class="mb-4">
            Мы можем обрабатывать определённые категории персональных данных для ограниченных целей, таких как выявление мошенничества, предотвращение отмывания денег, соблюдение законодательства и обеспечение доступа к нашим услугам. Это может включать информацию о состоянии здоровья, которую вы добровольно предоставляете при общении с нами.
          </p>
          <p class="mb-4">
            В соответствии с действующим законодательством мы можем обрабатывать данные, связанные с судимостями, правонарушениями и предполагаемыми нарушениями для проведения проверок, предотвращения и выявления преступлений, а также для соблюдения требований законов об отмывании денег, мошенничестве и финансировании терроризма. Важно отметить, что данная информация собирается только в исключительных случаях и не является частью нашей обычной деятельности.
          </p>
  
          <h3 class="text-xl font-semibold mt-4 mb-2">5. Персональные данные из общедоступных источников</h3>
          <p class="mb-4">
            Для соблюдения лицензионных условий и юридических обязательств мы можем получать информацию о вас из общедоступных источников, включая, но не ограничиваясь, публичными базами данных, социальными сетями, поисковыми системами и другими аналогичными ресурсами.
          </p>
  
          <h3 class="text-xl font-semibold mt-4 mb-2">6. Персональные данные, собираемые с помощью файлов cookie</h3>
          <p class="mb-4">
            Мы и наши поставщики услуг можем собирать информацию о вашем браузере и файлах cookie. «Файлы cookie» — это небольшие текстовые файлы, передаваемые на ваше устройство с сайта.
          </p>
  
          <h2 class="text-2xl font-semibold mt-4 mb-2">Как мы используем ваши персональные данные</h2>
          <h3 class="text-xl font-semibold mt-4 mb-2">1. Обработка ваших персональных данных для следующих целей</h3>
          <p class="mb-4">
            <strong>Для предоставления, настройки, поддержки и улучшения наших услуг.</strong> Это включает:
          </p>
          <ul class="list-disc list-inside mb-4">
            <li class="mb-2">Создание и управление учетными записями пользователей;</li>
            <li class="mb-2">Предоставление доступа к услугам и организация игровых активностей;</li>
            <li class="mb-2">Обеспечение участия в конкурсах;</li>
            <li class="mb-2">Обработка и управление платежами;</li>
            <li class="mb-2">Информирование пользователей об изменениях на Сайте, в услугах, а также в Правилах и условиях.</li>
          </ul>
          <p class="mb-4">
            <em>Персональные данные:</em> данные учетной записи, данные для верификации, данные переписки, платежные данные, игровые данные, данные устройства.<br>
            <em>Юридические основания:</em> исполнение договорных обязательств, соблюдение юридических требований, законные интересы (например, обеспечение работоспособности учетной записи).
          </p>
  
          <p class="mb-4">
            <strong>Для оказания клиентской поддержки.</strong> Это включает:
          </p>
          <ul class="list-disc list-inside mb-4">
            <li class="mb-2">Ответы на ваши запросы и вопросы;</li>
            <li class="mb-2">Улучшение процессов поддержки клиентов.</li>
          </ul>
          <p class="mb-4">
            <em>Персональные данные:</em> данные учетной записи, данные переписки, данные профиля.<br>
            <em>Юридические основания:</em> законные интересы (например, решение ваших вопросов и проблем).
          </p>
  
          <p class="mb-4">
            <strong>Для обеспечения безопасности, защиты и целостности наших услуг и Сайта.</strong> Это включает:
          </p>
          <ul class="list-disc list-inside mb-4">
            <li class="mb-2">Обеспечение безопасности сети и данных;</li>
            <li class="mb-2">Предотвращение несанкционированного доступа к электронным коммуникационным сетям и защита компьютерных систем.</li>
          </ul>
          <p class="mb-4">
            <em>Персональные данные:</em> данные учетной записи, платежные данные, игровые данные, данные устройства.<br>
            <em>Юридические основания:</em> соблюдение юридических обязательств, законные интересы (например, обеспечение безопасности сети).
          </p>
  
          <p class="mb-4">
            <strong>Для выполнения наших юридических обязательств.</strong> Это включает:
          </p>
          <ul class="list-disc list-inside mb-4">
            <li class="mb-2">Проведение проверки возраста;</li>
            <li class="mb-2">Верификацию личности для соблюдения требований KYC (Знай своего клиента);</li>
            <li class="mb-2">Предоставление возможности самоисключения от азартных игр;</li>
            <li class="mb-2">Защиту лиц от безответственного азартного поведения;</li>
            <li class="mb-2">Снижение вреда, связанного с азартными играми.</li>
          </ul>
          <p class="mb-4">
            <em>Персональные данные:</em> данные учетной записи, данные для верификации, данные переписки, платежные данные, игровые данные, данные устройства, данные активности, данные профиля.<br>
            <em>Юридические основания:</em> соблюдение юридических обязательств, законные интересы (например, приверженность социальной ответственности), а также общественные интересы.
          </p>
  
          <p class="mb-4">
            <strong>Для защиты нашего бизнеса от мошенничества, отмывания денег и других незаконных действий.</strong> Это включает:
          </p>
          <ul class="list-disc list-inside mb-4">
            <li class="mb-2">Предотвращение и выявление отмывания денег, финансирования терроризма и других незаконных действий;</li>
            <li class="mb-2">Снижение риска мошенничества.</li>
          </ul>
          <p class="mb-4">
            <em>Персональные данные:</em> данные учетной записи, данные для верификации, платежные данные, игровые данные, данные устройства, данные активности, данные профиля.<br>
            <em>Юридические основания:</em> соблюдение юридических обязательств, законные интересы (например, защита бизнеса от незаконных действий), а также общественные интересы.
          </p>
  
          <p class="mb-4">
            <strong>Для целей исследований и разработок.</strong> Это включает:
          </p>
          <ul class="list-disc list-inside mb-4">
            <li class="mb-2">Тестирование, анализ и улучшение пользовательского опыта;</li>
            <li class="mb-2">Оптимизацию услуг и работы Сайта;</li>
            <li class="mb-2">Усовершенствование маркетинговых кампаний;</li>
            <li class="mb-2">Разработку новых функций и продуктов.</li>
          </ul>
          <p class="mb-4">
            <em>Персональные данные:</em> платежные данные, игровые данные, данные устройства, данные активности, маркетинговые данные, данные профиля.<br>
            <em>Юридические основания:</em> законные интересы (например, предоставление более релевантных услуг).
          </p>
  
          <p class="mb-4">
            <strong>Для маркетинговых целей.</strong> Это включает:
          </p>
          <ul class="list-disc list-inside mb-4">
            <li class="mb-2">Персонализацию наших предложений;</li>
            <li class="mb-2">Предоставление рекомендаций, основанных на ваших предпочтениях;</li>
            <li class="mb-2">Оценку эффективности маркетинговых кампаний;</li>
            <li class="mb-2">Реализацию акций, таких как бонусы, программы лояльности и управление VIP.</li>
          </ul>
          <p class="mb-4">
            <em>Персональные данные:</em> данные учетной записи, платежные данные, игровые данные, данные активности, маркетинговые данные, данные профиля.<br>
            <em>Юридические основания:</em> согласие на получение маркетинговых коммуникаций и законные интересы (например, обеспечение персонализированного опыта).
          </p>
  
          <h3 class="text-xl font-semibold mt-4 mb-2">2. Автоматизированное принятие решений и профилирование</h3>
          <p class="mb-4">
            Мы строго соблюдаем лицензионные условия и юридические требования. Как оператор, соблюдающий принципы ответственных азартных игр, мы осуществляем мониторинг действий пользователей на Сайте для предотвращения мошенничества, отмывания денег и иных незаконных действий. Для этого наша автоматизированная система выявляет подозрительные действия, однако окончательное решение принимает уполномоченный специалист.
          </p>
          <p class="mb-4">
            Мы классифицируем пользователей на группы для работы программы лояльности и предоставления персонализированных услуг и игр. Данная сегментация проводится автоматически без вмешательства человека и не имеет юридических последствий для вас. Если результаты сегментации оказывают существенное влияние, перед принятием мер проводится ручная проверка.
          </p>
  
          <h2 class="text-2xl font-semibold mt-4 mb-2">Как мы передаем ваши персональные данные</h2>
          <h3 class="text-xl font-semibold mt-4 mb-2">1. Передача данных внутри группы компаний</h3>
          <p class="mb-4">
            В соответствии с применимым законодательством о защите данных и данным уведомлением, ваши персональные данные могут передаваться компаниям, входящим в нашу группу, с целью, указанной в разделе «Как мы используем ваши персональные данные» (например, для создания учетной записи, предоставления поддержки, управления рисками, соблюдения юридических требований, рассылки маркетинговых сообщений и предотвращения безответственного азартного поведения).
          </p>
  
          <h3 class="text-xl font-semibold mt-4 mb-2">2. Передача данных поставщикам услуг</h3>
          <p class="mb-4">
            Для обеспечения качественного предоставления услуг мы привлекаем сторонних поставщиков, с которыми заключаем договоры, обязывающие их обрабатывать ваши персональные данные безопасно и ответственно.
          </p>
          <p class="mb-4">Мы привлекаем следующие категории поставщиков:</p>
          <ul class="list-disc list-inside mb-4">
            <li class="mb-2"><strong>Хостинг-провайдеры:</strong> для хранения и передачи контента и данных;</li>
            <li class="mb-2"><strong>Маркетинговые провайдеры:</strong> для проведения рекламных кампаний;</li>
            <li class="mb-2"><strong>Поставщики IT и услуг безопасности:</strong> для защиты Сайта и инфраструктуры;</li>
            <li class="mb-2"><strong>Поставщики услуг поддержки:</strong> для ответа на ваши вопросы и решения проблем;</li>
            <li class="mb-2"><strong>Поставщики платежных услуг:</strong> для обработки платежей;</li>
            <li class="mb-2"><strong>Поставщики KYC и антимошеннических услуг:</strong> для проверки вашей личности, снижения рисков, связанных с отмыванием денег, а также для предотвращения мошенничества и иных незаконных действий. Эти поставщики могут выступать как независимые контролёры, поэтому с ними заключены договоры, обеспечивающие требуемый уровень защиты данных;</li>
            <li class="mb-2"><strong>Поставщики игрового и букмекерского контента:</strong> для предоставления соответствующего контента;</li>
            <li class="mb-2"><strong>Поставщики аналитических услуг:</strong> для оценки эффективности работы Сайта и маркетинговых кампаний;</li>
            <li class="mb-2"><strong>Поставщики аудиторских, юридических и комплаенс-услуг:</strong> для получения профессиональных консультаций.</li>
          </ul>
  
          <h3 class="text-xl font-semibold mt-4 mb-2">3. Передача данных в иных случаях</h3>
          <p class="mb-4">
            Мы раскрываем ваши персональные данные, если это требуется законом, в следующих случаях:
          </p>
          <ul class="list-disc list-inside mb-4">
            <li class="mb-2">Для выполнения запроса государственных органов (например, правоохранительных органов или иных государственных инстанций);</li>
            <li class="mb-2">Для соблюдения судебного приказа, обязывающего раскрыть данные;</li>
            <li class="mb-2">Для удовлетворения требований регуляторного расследования, проводимого соответствующим органом по азартным играм или службой по защите данных;</li>
            <li class="mb-2">Для установления, осуществления или защиты юридических претензий, включая проверки и запросы со стороны компетентных регуляторов;</li>
            <li class="mb-2">В случае продажи или приобретения бизнеса или активов, когда ваши персональные данные могут быть переданы потенциальным покупателям или продавцам, а также при переходе контроля над компанией.</li>
          </ul>
  
          <h2 class="text-2xl font-semibold mt-4 mb-2">Международная передача персональных данных</h2>
          <p class="mb-4">
            Наши поставщики услуг могут находиться за пределами Европейской экономической зоны (ЕЭЗ) в странах с иными стандартами защиты персональных данных. Однако мы принимаем все разумные меры для обеспечения защиты ваших данных, включая заключение договоров об обработке данных, соответствующих законодательству о защите персональных данных.
          </p>
          <p class="mb-4">Мы используем следующие механизмы:</p>
          <ul class="list-disc list-inside mb-4">
            <li class="mb-2">
              Передаём ваши персональные данные только в те страны, где такие передачи разрешены на основании решения о достаточности, вынесенного соответствующими регуляторами. Для получения дополнительной информации нажмите <a href="#" class="text-blue-500 hover:underline">здесь</a>;
            </li>
            <li class="mb-2">
              Также можем использовать стандартные договорные положения, одобренные регуляторами, что обеспечивает сопоставимый уровень защиты ваших данных с уровнем в ЕЭЗ. Подробнее о стандартных договорных положениях можно узнать, нажав <a href="#" class="text-blue-500 hover:underline">здесь</a>.
            </li>
          </ul>
  
          <h2 class="text-2xl font-semibold mt-4 mb-2">Ваши права</h2>
          <p class="mb-4">
            Вы обладаете следующими правами в отношении ваших персональных данных:
          </p>
          <ul class="list-disc list-inside mb-4">
            <li class="mb-2"><strong>Право доступа:</strong> вы можете запросить доступ к вашим данным, находящимся у нас;</li>
            <li class="mb-2"><strong>Право на исправление:</strong> вы можете потребовать исправления неточных или неполных данных;</li>
            <li class="mb-2"><strong>Право на удаление:</strong> в определённых случаях вы можете потребовать удаления ваших данных;</li>
            <li class="mb-2"><strong>Право на ограничение обработки:</strong> вы можете ограничить обработку ваших данных в определённых ситуациях;</li>
            <li class="mb-2"><strong>Право на перенос данных:</strong> вы можете запросить копию ваших данных в машиночитаемом формате;</li>
            <li class="mb-2"><strong>Право возражать:</strong> вы можете возразить против обработки ваших данных, в том числе для прямого маркетинга.</li>
          </ul>
          <p class="mb-4">
            Вы также имеете право отозвать своё согласие на обработку данных. Если вы хотите отозвать согласие или возразить против обработки для прямого маркетинга, воспользуйтесь инструментом настроек маркетинговых предпочтений в вашей учетной записи или следуйте инструкциям, указанным в наших сообщениях. Обработка запроса может занять до 48 часов. Для управления push-уведомлениями настройте соответствующие параметры на вашем устройстве.
          </p>
          <p class="mb-4">
            Если у вас возникнут вопросы относительно обработки ваших данных, вы имеете право подать жалобу в соответствующий орган по защите данных (например, в стране вашего постоянного проживания, месте работы или по факту предполагаемого нарушения).
          </p>
          <p class="mb-4">
            Мы просим вас сначала попытаться разрешить вопросы напрямую с нами (хотя вы вправе в любой момент обратиться в компетентный регулятор).
          </p>
  
          <h2 class="text-2xl font-semibold mt-4 mb-2">Как осуществить свои права</h2>
          <p class="mb-4">
            Для реализации ваших прав вы можете связаться с нами по адресу
            <a href="mailto:casino.assist.team@gmail.com" class="text-blue-500 hover:underline">
              casino.assist.team@gmail.com
            </a>
            или обратиться в нашу службу поддержки (по электронной почте, чату или телефону). За реализацию ваших прав плата не взимается.
          </p>
          <p class="mb-4">
            Мы постараемся ответить в течение одного месяца. Если выполнение запроса займет больше времени, мы сообщим вам конкретный срок обработки. В случае отказа мы предоставим объяснение.
          </p>
  
          <h2 class="text-2xl font-semibold mt-4 mb-2">Безопасность персональных данных</h2>
          <p class="mb-4">
            Мы строго соблюдаем нормы, стандарты и законы о конфиденциальности, при этом уделяя особое внимание мерам по защите данных. Мы применяем организационные, технические и административные меры для защиты ваших данных от несанкционированного доступа, изменения, раскрытия или уничтожения.
          </p>
  
          <h2 class="text-2xl font-semibold mt-4 mb-2">Хранение данных</h2>
          <p class="mb-4">
            Мы храним ваши персональные данные только в течение необходимого периода. Срок хранения может варьироваться в зависимости от объёма, характера и чувствительности данных, потенциальных рисков несанкционированного использования, целей обработки, возможностей достижения этих целей альтернативными способами и наших юридических обязательств.
          </p>
          <p class="mb-4">
            Например, для соблюдения норм по противодействию отмыванию денег и для защиты юридических интересов мы можем сохранять определённые данные до 6 лет после закрытия вашей учетной записи.
          </p>
  
          <h2 class="text-2xl font-semibold mt-4 mb-2">Изменения в уведомлении о конфиденциальности</h2>
          <p class="mb-4">
            Любые изменения в данном уведомлении будут опубликованы на этой странице и, при необходимости, сообщены вам по электронной почте. Рекомендуем регулярно проверять эту страницу для получения актуальной информации.
          </p>
        </div>
      </div>
    </BaseLayout>
  </template>
  
  <script>
  import BaseLayout from "@/Layouts/BaseLayout.vue";
  
  export default {
    name: "PrivacyPolicy",
    components: { BaseLayout },
    data() {
      return {
        isLoading: false,
      };
    },
    mounted() {},
    methods: {},
  };
  </script>
  
  <style scoped>
  /* Дополнительные стили при необходимости */
  </style>
  