<?php


return [
    'list_user'        => 'Список пользователей',
    'view_user'        => 'Просмотр пользователя',
    'edit_user'        => 'Редактировать пользователя',
    'change_password'  => 'Сменить пароль',
    'demo'             => 'Демо',
    'demo' => 'Демо',
    'demo' => 'Демо',
    'demo' => 'Демо',
    'demo' => 'Демо',
    'demo' => 'Демо',
    'demo' => 'Демо',
    'demo' => 'Демо',
    'demo' => 'Демо',
    'demo' => 'Демо',
    'demo' => 'Демо',
    'demo' => 'Демо',
    'demo' => 'Демо',
];
